perftests/run1.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0030 secs
  Slowest:	0.1731 secs
  Fastest:	0.0000 secs
  Average:	0.0114 secs
  Requests/sec:	17555.1314
  
  Total data:	63196560 bytes
  Size/request:	120 bytes

Response time histogram:
  0.000 [1]	|
  0.017 [406655]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [102507]	|■■■■■■■■■■
  0.052 [13846]	|■
  0.069 [2474]	|
  0.087 [778]	|
  0.104 [274]	|
  0.121 [72]	|
  0.138 [25]	|
  0.156 [4]	|
  0.173 [2]	|


Latency distribution:
  10% in 0.0019 secs
  25% in 0.0031 secs
  50% in 0.0090 secs
  75% in 0.0164 secs
  90% in 0.0239 secs
  95% in 0.0304 secs
  99% in 0.0476 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1731 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0060 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0273 secs
  resp wait:	0.0112 secs, 0.0000 secs, 0.1730 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0347 secs

Status code distribution:
  [400]	526638 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65424->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65425->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65426->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65427->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65428->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65429->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65430->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65431->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65432->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65433->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65434->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65435->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65436->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65437->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65438->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65439->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65440->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65441->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65442->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65443->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65444->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65445->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65446->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65447->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65448->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65449->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65450->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65451->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65452->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65453->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65454->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65455->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65456->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65457->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65458->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65459->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65460->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65461->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65462->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65463->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65464->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65465->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65466->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65467->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65468->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65469->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65470->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65471->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65472->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65473->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65474->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65475->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65476->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65477->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65478->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65479->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65480->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65481->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65482->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65483->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65484->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65485->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65486->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65487->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65488->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65489->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65490->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:65491->[::1]:9000: read: connection reset by peer