perftests/run1.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0069 secs
  Slowest:	0.0713 secs
  Fastest:	0.0000 secs
  Average:	0.0079 secs
  Requests/sec:	25386.6980
  
  Total data:	90649083 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [424038]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.014 [214990]	|■■■■■■■■■■■■■■■■■■■■
  0.021 [84288]	|■■■■■■■■
  0.029 [27523]	|■■■
  0.036 [8074]	|■
  0.043 [2086]	|
  0.050 [570]	|
  0.057 [154]	|
  0.064 [22]	|
  0.071 [11]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0024 secs
  50% in 0.0063 secs
  75% in 0.0113 secs
  90% in 0.0173 secs
  95% in 0.0215 secs
  99% in 0.0305 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0713 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0060 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0079 secs, 0.0000 secs, 0.0713 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0016 secs

Status code distribution:
  [400]	761757 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58627->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58629->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58631->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58633->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58634->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58635->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58637->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58640->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58641->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58642->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58643->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58703->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58709->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58711->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58715->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58716->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58717->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58723->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:58725->127.0.0.1:9000: read: connection reset by peer